# ThermalAsset Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ThermalAsset Properties
ThermalAsset Class See Also
---
The ThermalAsset type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Behavior | Flag indicating whether elements of this material behave isotropically or orthotropically. |
| Compressibility | The compressibility of the asset. |
| Density | The density of the asset. |
| ElectricalResistivity | The electrical resistivity of the asset. |
| Emissivity | The emissivity of the asset. |
| GasViscosity | The gas viscosity of the asset. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LiquidViscosity | The liquid viscosity of the asset. |
| Name | The name of the thermal asset. |
| Permeability | The permeability of the asset. |
| Porosity | The porosity of the asset. |
| Reflectivity | The reflectivity of the asset. |
| SpecificHeat | The specific heat of the asset. |
| SpecificHeatOfVaporization | The specific heat of vaporization of the asset. |
| ThermalConductivity | The thermal conductivity of the asset. |
| ThermalMaterialType | The type of material that this thermal asset describes (e.g. solid, liquid, gas.) |
| TransmitsLight | A boolean flag that indicates whether or not the asset transmits light. |
| VaporPressure | The vapor pressure of the asset. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace